ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_57 (Dense)             (None, 32)                608       
_________________________________________________________________
batch_normalization_65 (Batc (None, 32)                128       
_________________________________________________________________
dropout_65 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_58 (Dense)             (None, 64)                2112      
_________________________________________________________________
batch_normalization_66 (Batc (None, 64)                256       
_________________________________________________________________
dropout_66 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_59 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_67 (Batc (None, 32)                128       
_________________________________________________________________
dropout_67 (Dropout)         (None, 32)                0         
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 132       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 5,444
Trainable params: 5,188
Non-trainable params: 256
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_63 (Dense)                (None, 32)           608         states[0][0]                     
__________________________________________________________________________________________________
dense_65 (Dense)                (None, 32)           160         actions[0][0]                    
__________________________________________________________________________________________________
batch_normalization_73 (BatchNo (None, 32)           128         dense_63[0][0]                   
__________________________________________________________________________________________________
batch_normalization_75 (BatchNo (None, 32)           128         dense_65[0][0]                   
__________________________________________________________________________________________________
dropout_73 (Dropout)            (None, 32)           0           batch_normalization_73[0][0]     
__________________________________________________________________________________________________
dropout_75 (Dropout)            (None, 32)           0           batch_normalization_75[0][0]     
__________________________________________________________________________________________________
dense_64 (Dense)                (None, 64)           2112        dropout_73[0][0]                 
__________________________________________________________________________________________________
dense_66 (Dense)                (None, 64)           2112        dropout_75[0][0]                 
__________________________________________________________________________________________________
batch_normalization_74 (BatchNo (None, 64)           256         dense_64[0][0]                   
__________________________________________________________________________________________________
batch_normalization_76 (BatchNo (None, 64)           256         dense_66[0][0]                   
__________________________________________________________________________________________________
dropout_74 (Dropout)            (None, 64)           0           batch_normalization_74[0][0]     
__________________________________________________________________________________________________
dropout_76 (Dropout)            (None, 64)           0           batch_normalization_76[0][0]     
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64)           0           dropout_74[0][0]                 
                                                                 dropout_76[0][0]                 
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64)           0           add_9[0][0]                      
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            65          activation_9[0][0]               
==================================================================================================
Total params: 5,825
Trainable params: 5,441
Non-trainable params: 384
__________________________________________________________________________________________________
