ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 32)                608       
_________________________________________________________________
batch_normalization_81 (Batc (None, 32)                128       
_________________________________________________________________
dropout_81 (Dropout)         (None, 32)                0         
_________________________________________________________________
dense_72 (Dense)             (None, 64)                2112      
_________________________________________________________________
batch_normalization_82 (Batc (None, 64)                256       
_________________________________________________________________
dropout_82 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_73 (Dense)             (None, 32)                2080      
_________________________________________________________________
batch_normalization_83 (Batc (None, 32)                128       
_________________________________________________________________
dropout_83 (Dropout)         (None, 32)                0         
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 132       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 5,444
Trainable params: 5,188
Non-trainable params: 256
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_77 (Dense)                (None, 32)           608         states[0][0]                     
__________________________________________________________________________________________________
dense_79 (Dense)                (None, 32)           160         actions[0][0]                    
__________________________________________________________________________________________________
batch_normalization_89 (BatchNo (None, 32)           128         dense_77[0][0]                   
__________________________________________________________________________________________________
batch_normalization_91 (BatchNo (None, 32)           128         dense_79[0][0]                   
__________________________________________________________________________________________________
dropout_89 (Dropout)            (None, 32)           0           batch_normalization_89[0][0]     
__________________________________________________________________________________________________
dropout_91 (Dropout)            (None, 32)           0           batch_normalization_91[0][0]     
__________________________________________________________________________________________________
dense_78 (Dense)                (None, 64)           2112        dropout_89[0][0]                 
__________________________________________________________________________________________________
dense_80 (Dense)                (None, 64)           2112        dropout_91[0][0]                 
__________________________________________________________________________________________________
batch_normalization_90 (BatchNo (None, 64)           256         dense_78[0][0]                   
__________________________________________________________________________________________________
batch_normalization_92 (BatchNo (None, 64)           256         dense_80[0][0]                   
__________________________________________________________________________________________________
dropout_90 (Dropout)            (None, 64)           0           batch_normalization_90[0][0]     
__________________________________________________________________________________________________
dropout_92 (Dropout)            (None, 64)           0           batch_normalization_92[0][0]     
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64)           0           dropout_90[0][0]                 
                                                                 dropout_92[0][0]                 
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64)           0           add_11[0][0]                     
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            65          activation_11[0][0]              
==================================================================================================
Total params: 5,825
Trainable params: 5,441
Non-trainable params: 384
__________________________________________________________________________________________________
