ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_29 (Dense)             (None, 100)               1900      
_________________________________________________________________
batch_normalization_33 (Batc (None, 100)               400       
_________________________________________________________________
dropout_33 (Dropout)         (None, 100)               0         
_________________________________________________________________
dense_30 (Dense)             (None, 200)               20200     
_________________________________________________________________
batch_normalization_34 (Batc (None, 200)               800       
_________________________________________________________________
dropout_34 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 100)               20100     
_________________________________________________________________
batch_normalization_35 (Batc (None, 100)               400       
_________________________________________________________________
dropout_35 (Dropout)         (None, 100)               0         
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 404       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 44,204
Trainable params: 43,404
Non-trainable params: 800
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_35 (Dense)                (None, 100)          1900        states[0][0]                     
__________________________________________________________________________________________________
dense_37 (Dense)                (None, 100)          500         actions[0][0]                    
__________________________________________________________________________________________________
batch_normalization_41 (BatchNo (None, 100)          400         dense_35[0][0]                   
__________________________________________________________________________________________________
batch_normalization_43 (BatchNo (None, 100)          400         dense_37[0][0]                   
__________________________________________________________________________________________________
dropout_41 (Dropout)            (None, 100)          0           batch_normalization_41[0][0]     
__________________________________________________________________________________________________
dropout_43 (Dropout)            (None, 100)          0           batch_normalization_43[0][0]     
__________________________________________________________________________________________________
dense_36 (Dense)                (None, 200)          20200       dropout_41[0][0]                 
__________________________________________________________________________________________________
dense_38 (Dense)                (None, 200)          20200       dropout_43[0][0]                 
__________________________________________________________________________________________________
batch_normalization_42 (BatchNo (None, 200)          800         dense_36[0][0]                   
__________________________________________________________________________________________________
batch_normalization_44 (BatchNo (None, 200)          800         dense_38[0][0]                   
__________________________________________________________________________________________________
dropout_42 (Dropout)            (None, 200)          0           batch_normalization_42[0][0]     
__________________________________________________________________________________________________
dropout_44 (Dropout)            (None, 200)          0           batch_normalization_44[0][0]     
__________________________________________________________________________________________________
add_5 (Add)                     (None, 200)          0           dropout_42[0][0]                 
                                                                 dropout_44[0][0]                 
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 200)          0           add_5[0][0]                      
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            201         activation_5[0][0]               
==================================================================================================
Total params: 45,401
Trainable params: 44,201
Non-trainable params: 1,200
__________________________________________________________________________________________________
