ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_43 (Dense)             (None, 64)                1216      
_________________________________________________________________
dense_44 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_45 (Dense)             (None, 64)                8256      
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 260       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 18,052
Trainable params: 18,052
Non-trainable params: 0
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_49 (Dense)                (None, 64)           1216        states[0][0]                     
__________________________________________________________________________________________________
dense_51 (Dense)                (None, 64)           320         actions[0][0]                    
__________________________________________________________________________________________________
dense_50 (Dense)                (None, 128)          8320        dense_49[0][0]                   
__________________________________________________________________________________________________
dense_52 (Dense)                (None, 128)          8320        dense_51[0][0]                   
__________________________________________________________________________________________________
add_7 (Add)                     (None, 128)          0           dense_50[0][0]                   
                                                                 dense_52[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 128)          0           add_7[0][0]                      
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            129         activation_7[0][0]               
==================================================================================================
Total params: 18,305
Trainable params: 18,305
Non-trainable params: 0
__________________________________________________________________________________________________
