ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_99 (Dense)             (None, 32)                608       
_________________________________________________________________
batch_normalization_113 (Bat (None, 32)                128       
_________________________________________________________________
dropout_113 (Dropout)        (None, 32)                0         
_________________________________________________________________
dense_100 (Dense)            (None, 64)                2112      
_________________________________________________________________
batch_normalization_114 (Bat (None, 64)                256       
_________________________________________________________________
dropout_114 (Dropout)        (None, 64)                0         
_________________________________________________________________
dense_101 (Dense)            (None, 32)                2080      
_________________________________________________________________
batch_normalization_115 (Bat (None, 32)                128       
_________________________________________________________________
dropout_115 (Dropout)        (None, 32)                0         
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 132       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 5,444
Trainable params: 5,188
Non-trainable params: 256
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_105 (Dense)               (None, 32)           608         states[0][0]                     
__________________________________________________________________________________________________
dense_107 (Dense)               (None, 32)           160         actions[0][0]                    
__________________________________________________________________________________________________
batch_normalization_121 (BatchN (None, 32)           128         dense_105[0][0]                  
__________________________________________________________________________________________________
batch_normalization_123 (BatchN (None, 32)           128         dense_107[0][0]                  
__________________________________________________________________________________________________
dropout_121 (Dropout)           (None, 32)           0           batch_normalization_121[0][0]    
__________________________________________________________________________________________________
dropout_123 (Dropout)           (None, 32)           0           batch_normalization_123[0][0]    
__________________________________________________________________________________________________
dense_106 (Dense)               (None, 64)           2112        dropout_121[0][0]                
__________________________________________________________________________________________________
dense_108 (Dense)               (None, 64)           2112        dropout_123[0][0]                
__________________________________________________________________________________________________
batch_normalization_122 (BatchN (None, 64)           256         dense_106[0][0]                  
__________________________________________________________________________________________________
batch_normalization_124 (BatchN (None, 64)           256         dense_108[0][0]                  
__________________________________________________________________________________________________
dropout_122 (Dropout)           (None, 64)           0           batch_normalization_122[0][0]    
__________________________________________________________________________________________________
dropout_124 (Dropout)           (None, 64)           0           batch_normalization_124[0][0]    
__________________________________________________________________________________________________
add_15 (Add)                    (None, 64)           0           dropout_122[0][0]                
                                                                 dropout_124[0][0]                
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 64)           0           add_15[0][0]                     
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            65          activation_15[0][0]              
==================================================================================================
Total params: 5,825
Trainable params: 5,441
Non-trainable params: 384
__________________________________________________________________________________________________
