ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_71 (Dense)             (None, 64)                1216      
_________________________________________________________________
dense_72 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_73 (Dense)             (None, 64)                8256      
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 260       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 18,052
Trainable params: 18,052
Non-trainable params: 0
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_77 (Dense)                (None, 64)           1216        states[0][0]                     
__________________________________________________________________________________________________
dense_79 (Dense)                (None, 64)           320         actions[0][0]                    
__________________________________________________________________________________________________
dense_78 (Dense)                (None, 128)          8320        dense_77[0][0]                   
__________________________________________________________________________________________________
dense_80 (Dense)                (None, 128)          8320        dense_79[0][0]                   
__________________________________________________________________________________________________
add_11 (Add)                    (None, 128)          0           dense_78[0][0]                   
                                                                 dense_80[0][0]                   
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128)          0           add_11[0][0]                     
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            129         activation_11[0][0]              
==================================================================================================
Total params: 18,305
Trainable params: 18,305
Non-trainable params: 0
__________________________________________________________________________________________________
