ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 64)                1216      
_________________________________________________________________
dense_16 (Dense)             (None, 128)               8320      
_________________________________________________________________
dense_17 (Dense)             (None, 64)                8256      
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 260       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 18,052
Trainable params: 18,052
Non-trainable params: 0
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 64)           1216        states[0][0]                     
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 64)           320         actions[0][0]                    
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 128)          8320        dense_21[0][0]                   
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 128)          8320        dense_23[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 128)          0           dense_22[0][0]                   
                                                                 dense_24[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 128)          0           add_3[0][0]                      
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            129         activation_3[0][0]               
==================================================================================================
Total params: 18,305
Trainable params: 18,305
Non-trainable params: 0
__________________________________________________________________________________________________
