ACTOR LOCAL:
============
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
states (InputLayer)          (None, 18)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                608       
_________________________________________________________________
batch_normalization_1 (Batch (None, 32)                128       
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2112      
_________________________________________________________________
batch_normalization_2 (Batch (None, 64)                256       
_________________________________________________________________
dropout_2 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 32)                2080      
_________________________________________________________________
batch_normalization_3 (Batch (None, 32)                128       
_________________________________________________________________
dropout_3 (Dropout)          (None, 32)                0         
_________________________________________________________________
raw_actions (Dense)          (None, 4)                 132       
_________________________________________________________________
actions (Lambda)             (None, 4)                 0         
=================================================================
Total params: 5,444
Trainable params: 5,188
Non-trainable params: 256
_________________________________________________________________


CRITIC LOCAL:
=============
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
states (InputLayer)             (None, 18)           0                                            
__________________________________________________________________________________________________
actions (InputLayer)            (None, 4)            0                                            
__________________________________________________________________________________________________
dense_7 (Dense)                 (None, 32)           608         states[0][0]                     
__________________________________________________________________________________________________
dense_9 (Dense)                 (None, 32)           160         actions[0][0]                    
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32)           128         dense_7[0][0]                    
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32)           128         dense_9[0][0]                    
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 32)           0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 32)           0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
dense_8 (Dense)                 (None, 64)           2112        dropout_9[0][0]                  
__________________________________________________________________________________________________
dense_10 (Dense)                (None, 64)           2112        dropout_11[0][0]                 
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 64)           256         dense_8[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 64)           256         dense_10[0][0]                   
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 64)           0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 64)           0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64)           0           dropout_10[0][0]                 
                                                                 dropout_12[0][0]                 
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64)           0           add_1[0][0]                      
__________________________________________________________________________________________________
q_values (Dense)                (None, 1)            65          activation_1[0][0]               
==================================================================================================
Total params: 5,825
Trainable params: 5,441
Non-trainable params: 384
__________________________________________________________________________________________________
